## pandas

In [6]:
import pandas as pd
import numpy as np

## Series

## Uma series é como um array unidimencional, uma lista de valores que sempre tem um índice relacionado, que rotula cada elemento da lista formando uma estrutura semelahndo a de um dicionaro do Python.

In [7]:
lista = [10,20,30]
array = np.array(lista)

dic = {'A':10, 'B':20,'C':30}

In [8]:
pd.Series(lista) # cria um numero natual para cada elemento

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(dic)# usa o indice como a própria chave

A    10
B    20
C    30
dtype: int64

In [17]:
# define a serie, ou seja, o indice dos elementos como x, y e z
coord = pd.Series(lista,['X','Y','Z'])
coord

X    10
Y    20
Z    30
dtype: int64

In [16]:
coord = pd.Series(['X','Y','Z'],lista)
coord

10    X
20    Y
30    Z
dtype: object

In [19]:
# criando de novo
coord = pd.Series(lista,['X','Y','Z'])
coord

X    10
Y    20
Z    30
dtype: int64

In [21]:
# acessar por indice
coord['X']

10

In [22]:
coord['Y']

20

In [30]:
s = pd.Series(np.random.randint(1,10,15))
s

0     7
1     3
2     3
3     9
4     7
5     6
6     5
7     5
8     7
9     6
10    6
11    9
12    1
13    2
14    4
dtype: int32

In [25]:
#metodos estatisticos
s.mean()

51.9

In [26]:
s.max()

99

In [32]:
s.value_counts()

7    3
6    3
9    2
5    2
3    2
4    1
2    1
1    1
dtype: int64

In [36]:
#metodo describe - uma serie de informações
s.describe()

count    15.000000
mean      5.333333
std       2.380476
min       1.000000
25%       3.500000
50%       6.000000
75%       7.000000
max       9.000000
dtype: float64

In [37]:
#metodo describe - uma serie de informações
s.describe()['mean']

5.333333333333333

In [39]:
#operações com escalares
s = pd.Series(np.random.randint(1,100,10))
s

0    34
1    28
2    93
3    45
4    39
5    51
6     9
7    48
8    11
9    62
dtype: int32

In [44]:
#operações com escalares
s / 10
#s * 10

0    3.4
1    2.8
2    9.3
3    4.5
4    3.9
5    5.1
6    0.9
7    4.8
8    1.1
9    6.2
dtype: float64

In [45]:
#operações escalares baseadas em indices
female_by_uf = pd.Series([123123,15123412,5134513,3682456,['AL','AM','AP','BA']])
female_by_uf

0              123123
1            15123412
2             5134513
3             3682456
4    [AL, AM, AP, BA]
dtype: object

In [46]:
#operações escalares baseadas em indices
male_by_uf = pd.Series([256245,857903,89228,3486421,['AL','AM','AP','BA']])
male_by_uf

0              256245
1              857903
2               89228
3             3486421
4    [AL, AM, AP, BA]
dtype: object

In [48]:
#somou quando encontrou a relação de um indice com o outro
#AL + AL, AM + AM
total_by_uf = female_by_uf + male_by_uf
total_by_uf

0                              379368
1                            15981315
2                             5223741
3                             7168877
4    [AL, AM, AP, BA, AL, AM, AP, BA]
dtype: object

In [ ]:
# quando indices não coninciderem, a pandas coloca o NAN

## Data Frame

## principal obj do pandas. Grupo de Series

## pode ser criado de várias formas:

In [60]:
#criar a partir de listas
pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]],['A','B','C'])

# indice é o da lateral, o que identifica o X
# titulos de coluna não são indices

    0   1   2
A  10  20  30
B  40  50  60
C  70  80  90

In [62]:
pd.DataFrame(np.random.rand(5,4))

          0         1         2         3
0  0.689260  0.082063  0.430871  0.369499
1  0.743419  0.678258  0.087388  0.893628
2  0.699874  0.619570  0.902878  0.952578
3  0.963165  0.199602  0.649649  0.303079
4  0.851099  0.890693  0.861996  0.705149

In [66]:
pd.DataFrame(np.random.rand(5,4),index=['A','B','C','D','E'],columns=['C1','C2','C3','C4'])

         C1        C2        C3        C4
A  0.736657  0.740627  0.375595  0.324229
B  0.884585  0.426729  0.489748  0.688549
C  0.548563  0.401007  0.963260  0.226792
D  0.068874  0.748967  0.158782  0.360504
E  0.521536  0.053193  0.217039  0.364870

In [69]:
#assim fica igual o excel
pd.DataFrame(np.random.rand(5,4),columns=['A','B','C','D'])

          A         B         C         D
0  0.709297  0.096759  0.295303  0.795087
1  0.751584  0.493476  0.634968  0.015240
2  0.307587  0.567185  0.743652  0.854145
3  0.424803  0.508558  0.521407  0.164147
4  0.892576  0.466730  0.159036  0.496301

In [71]:

df = pd.DataFrame(np.random.rand(5,4),columns=['A','B','C','D'])
df

          A         B         C         D
0  0.311217  0.370277  0.042932  0.520917
1  0.755913  0.119769  0.871257  0.420271
2  0.558281  0.045880  0.105406  0.276182
3  0.751561  0.906386  0.901578  0.766628
4  0.820587  0.053895  0.360188  0.636123

In [76]:
df['A']

0    0.311217
1    0.755913
2    0.558281
3    0.751561
4    0.820587
Name: A, dtype: float64

In [77]:
df['A'][0]

0.3112166805143033

In [81]:
df[['B','D']]

          B         D
2  0.045880  0.276182
3  0.906386  0.766628
4  0.053895  0.636123

In [82]:
df[['B','D']][2:]

          B         D
2  0.045880  0.276182
3  0.906386  0.766628
4  0.053895  0.636123

In [92]:
#criar outras colunas
df['A_C'] = df['A'] + df['C']
df

          A         B         C         D       A_C
0  0.311217  0.370277  0.042932  0.520917  0.354149
1  0.755913  0.119769  0.871257  0.420271  1.627170
2  0.558281  0.045880  0.105406  0.276182  0.663687
3  0.751561  0.906386  0.901578  0.766628  1.653139
4  0.820587  0.053895  0.360188  0.636123  1.180775

In [94]:
#pode criar outra lista com base em outro conjunto amostral, nao necessariamente outras colunas
df['Outro'] = [1,2,3,4,5]
df

          A         B         C         D       A_C  Outro
0  0.311217  0.370277  0.042932  0.520917  0.354149      1
1  0.755913  0.119769  0.871257  0.420271  1.627170      2
2  0.558281  0.045880  0.105406  0.276182  0.663687      3
3  0.751561  0.906386  0.901578  0.766628  1.653139      4
4  0.820587  0.053895  0.360188  0.636123  1.180775      5

In [95]:
df['coef'] = df['A_C'] / df['Outro'] / 10
df

          A         B         C         D       A_C  Outro      coef
0  0.311217  0.370277  0.042932  0.520917  0.354149      1  0.035415
1  0.755913  0.119769  0.871257  0.420271  1.627170      2  0.081359
2  0.558281  0.045880  0.105406  0.276182  0.663687      3  0.022123
3  0.751561  0.906386  0.901578  0.766628  1.653139      4  0.041328
4  0.820587  0.053895  0.360188  0.636123  1.180775      5  0.023616

In [109]:
#excluir coluna - padrão é excluir linha... por isso tem que passar axis = 1
df.drop('coef',axis=1)

          A         B         C         D       A_C  Outro
0  0.311217  0.370277  0.042932  0.520917  0.354149      1
1  0.755913  0.119769  0.871257  0.420271  1.627170      2
2  0.558281  0.045880  0.105406  0.276182  0.663687      3
3  0.751561  0.906386  0.901578  0.766628  1.653139      4
4  0.820587  0.053895  0.360188  0.636123  1.180775      5

In [114]:
#exclui a linha 1
df.drop(1)

          A         B         C         D       A_C  Outro      coef
0  0.311217  0.370277  0.042932  0.520917  0.354149      1  0.035415
2  0.558281  0.045880  0.105406  0.276182  0.663687      3  0.022123
3  0.751561  0.906386  0.901578  0.766628  1.653139      4  0.041328
4  0.820587  0.053895  0.360188  0.636123  1.180775      5  0.023616

In [116]:
#se eu colocar o inplace, ele muda a própria variavel. Se nao passa inplice = true, então nao alterada a variavel original
df.drop(2,inplace=True)
df

          A         B         C         D       A_C  Outro      coef
0  0.311217  0.370277  0.042932  0.520917  0.354149      1  0.035415
1  0.755913  0.119769  0.871257  0.420271  1.627170      2  0.081359
3  0.751561  0.906386  0.901578  0.766628  1.653139      4  0.041328
4  0.820587  0.053895  0.360188  0.636123  1.180775      5  0.023616

In [117]:
#a linha 2 nao existe mais na variavel original
df

          A         B         C         D       A_C  Outro      coef
0  0.311217  0.370277  0.042932  0.520917  0.354149      1  0.035415
1  0.755913  0.119769  0.871257  0.420271  1.627170      2  0.081359
3  0.751561  0.906386  0.901578  0.766628  1.653139      4  0.041328
4  0.820587  0.053895  0.360188  0.636123  1.180775      5  0.023616

In [126]:
df2 = pd.DataFrame(np.random.rand(5,4),index=['A','B','C','D','E'],columns=['C1','C2','C3','C4'])
df2

         C1        C2        C3        C4
A  0.835909  0.967749  0.389746  0.878479
B  0.857349  0.220764  0.092603  0.117101
C  0.134228  0.493916  0.364395  0.575968
D  0.384387  0.701156  0.915066  0.415280
E  0.443848  0.061016  0.122631  0.635983

In [130]:
#fazer busca baseado no indice e o retorno é uma series
#nome de coluna vira um indice
#pinçar valor baseado em linha e coluna
df2.loc['A','C1']

0.8359092080014473

In [131]:
#pra buscar determinada coluna tem que ser por LOC
#para coluna, usa\ sem o loc
df2.loc['C']

C1    0.134228
C2    0.493916
C3    0.364395
C4    0.575968
Name: C, dtype: float64

In [133]:
df2.loc[['A','C'],['C1','C3']]

         C1        C3
A  0.835909  0.389746
C  0.134228  0.364395

In [141]:
#sintaxe do slice
#indexloc
df2.iloc[1:4,::2]

         C1        C3
B  0.857349  0.092603
C  0.134228  0.364395
D  0.384387  0.915066

In [143]:
#seleção condicional
df2

         C1        C2        C3        C4
A  0.835909  0.967749  0.389746  0.878479
B  0.857349  0.220764  0.092603  0.117101
C  0.134228  0.493916  0.364395  0.575968
D  0.384387  0.701156  0.915066  0.415280
E  0.443848  0.061016  0.122631  0.635983

In [144]:
df2 > 0

     C1    C2    C3    C4
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [150]:
df2[df2 > 0.3]

         C1        C2        C3        C4
A  0.835909  0.967749  0.389746  0.878479
B  0.857349       NaN       NaN       NaN
C       NaN  0.493916  0.364395  0.575968
D  0.384387  0.701156  0.915066  0.415280
E  0.443848       NaN       NaN  0.635983

In [154]:
df2[df2['C1'] > 0.5]

         C1        C2        C3        C4
A  0.835909  0.967749  0.389746  0.878479
B  0.857349  0.220764  0.092603  0.117101

In [155]:
df2[df2['C1'] > 0.5][['C3','C4']]

         C3        C4
A  0.389746  0.878479
B  0.092603  0.117101

In [160]:
df2[df2['C1'] < 0.5].loc[['C','D']]

         C1        C2        C3        C4
C  0.134228  0.493916  0.364395  0.575968
D  0.384387  0.701156  0.915066  0.415280

In [167]:
df

          A         B         C         D       A_C  Outro      coef
0  0.311217  0.370277  0.042932  0.520917  0.354149      1  0.035415
1  0.755913  0.119769  0.871257  0.420271  1.627170      2  0.081359
3  0.751561  0.906386  0.901578  0.766628  1.653139      4  0.041328
4  0.820587  0.053895  0.360188  0.636123  1.180775      5  0.023616

In [168]:
df.reset_index()

   index         A         B         C         D       A_C  Outro      coef
0      0  0.311217  0.370277  0.042932  0.520917  0.354149      1  0.035415
1      1  0.755913  0.119769  0.871257  0.420271  1.627170      2  0.081359
2      3  0.751561  0.906386  0.901578  0.766628  1.653139      4  0.041328
3      4  0.820587  0.053895  0.360188  0.636123  1.180775      5  0.023616

In [171]:
df['Estados'] = ['SP','RJ','MG','ES']

In [180]:
df.set_index('Estados',inplace=True)

KeyError: "None of ['Estados'] are in the columns"

In [182]:
df

                A         B         C         D       A_C  Outro      coef
Estados
SP       0.311217  0.370277  0.042932  0.520917  0.354149      1  0.035415
RJ       0.755913  0.119769  0.871257  0.420271  1.627170      2  0.081359
MG       0.751561  0.906386  0.901578  0.766628  1.653139      4  0.041328
ES       0.820587  0.053895  0.360188  0.636123  1.180775      5  0.023616


## Agrupoamentos - mais avançado um pouco

In [ ]:
import pandas as pd
data = {'Team'  :  ['Alfa', 'Beta', 'Alfa', 'Beta', 'Beta', 'Alfa'],
       'Seller':  ['Bob','Sam','Charlie','Smith','Sam', 'Bob'],
       'Sale'    : [120,250,180,100,95,278]}

df = pd.DataFrame(data)
df

In [212]:
by_team = df.groupby(by='Team')

In [213]:
type(by_team)#group by

pandas.core.groupby.generic.DataFrameGroupBy

In [214]:
by_team.sum()

      Sale
Team
Alfa   578
Beta   445

In [215]:
by_team.max()

       Seller  Sale
Team
Alfa  Charlie   278
Beta    Smith   250

In [216]:
by_team.min()

     Seller  Sale
Team
Alfa    Bob   120
Beta    Sam    95

In [217]:
by_team.mean()

            Sale
Team
Alfa  192.666667
Beta  148.333333

In [218]:
by_team.describe()

      Sale
     count        mean        std    min    25%    50%    75%    max
Team
Alfa   3.0  192.666667  79.757967  120.0  150.0  180.0  229.0  278.0
Beta   3.0  148.333333  88.081402   95.0   97.5  100.0  175.0  250.0

In [219]:
by_seller = df.groupby(by='Seller')

In [220]:
by_seller.describe()

         Sale
        count   mean         std    min     25%    50%     75%    max
Seller
Bob       2.0  199.0  111.722871  120.0  159.50  199.0  238.50  278.0
Charlie   1.0  180.0         NaN  180.0  180.00  180.0  180.00  180.0
Sam       2.0  172.5  109.601551   95.0  133.75  172.5  211.25  250.0
Smith     1.0  100.0         NaN  100.0  100.00  100.0  100.00  100.0

## entrada e saida - mais pra frente fala melhor

## pd.read_XXXX
## pd.to_XXXX

In [221]:
df = pd.read_csv('heroes_information.csv')

In [222]:
df

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,-,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,-,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,-,bad,-99.0
...,...,...,...,...,...,...,...,...,...,...,...
729,729,Yellowjacket II,Female,blue,Human,Strawberry Blond,165.0,Marvel Comics,-,good,52.0
730,730,Ymir,Male,white,Frost Giant,No Hair,304.8,Marvel Comics,white,good,-99.0
731,731,Yoda,Male,brown,Yoda's species,White,66.0,George Lucas,green,good,17.0
732,732,Zatanna,Female,blue,Human,Black,170.0,DC Comics,-,good,57.0
733,733,Zoom,Male,red,-,Brown,185.0,DC Comics,-,bad,81.0

In [223]:
df.to_json('heroes.json')

In [227]:
#df.to_csv('sales.csv')
df.to_csv('sales.csv', index = False)
df.to_excel('sales.xls')
df.to_clipboard()

In [230]:
df

   Team   Seller  Sale
0  Alfa      Bob   120
1  Beta      Sam   250
2  Alfa  Charlie   180
3  Beta    Smith   100
4  Beta      Sam    95
5  Alfa      Bob   278

In [229]:
df.index

RangeIndex(start=0, stop=6, step=1)

## multiindex

In [ ]:
groups = [('Grupo 1', 'Sub1'),
         ('Grupo 1', 'Sub2'),
         ('Grupo 1', 'Sub3'),
         ('Grupo 2', 'Sub1'),
         ('Grupo 2', 'Sub2'),
         ('Grupo 2', 'Sub2'),]

In [231]:
df = pd.DataFrame(np.random.rand(6,2))

# me perdi.. ver multiindex no arquivo do professor!!!!!

## DADOS FALTANTES - QUANDO VEM VALOR FALTANDO NO DATASET

In [236]:
# analisar quais informações estão faltando e faze-las deixarem de faltar
df = pd.DataFrame({'A' : [1,2,3],'B':[np.nan,4,5],'C':[np.nan,7,np.nan]})
df

   A    B    C
0  1  NaN  NaN
1  2  4.0  7.0
2  3  5.0  NaN

In [237]:
df.dropna()

   A    B    C
1  2  4.0  7.0

In [238]:
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [240]:
df.dropna(axis=1,thresh=2) # dropa a partir da ideia de ter 2 ou mais NANs

   A    B
0  1  NaN
1  2  4.0
2  3  5.0

## df.fillna()

In [241]:
# preenche os nans com o valor especifico
df.fillna(0)

   A    B    C
0  1  0.0  0.0
1  2  4.0  7.0
2  3  5.0  0.0

In [242]:
df.fillna(df.mean())

   A    B    C
0  1  4.5  7.0
1  2  4.0  7.0
2  3  5.0  7.0

In [243]:
df.fillna(df.max())

   A    B    C
0  1  5.0  7.0
1  2  4.0  7.0
2  3  5.0  7.0

In [248]:
df.fillna(method='ffill',axis=1)

     A    B    C
0  1.0  1.0  1.0
1  2.0  4.0  7.0
2  3.0  5.0  5.0

In [249]:
df.mean()

A    2.0
B    4.5
C    7.0
dtype: float64

In [250]:
# ver mais exemplos no video

In [253]:
df.mean().mean()

4.5

In [ ]:
# É IMPORTANTE SABER O QUE PRECISA FAZER PARA AI SIM VER O MELHOR METODO A SER UTILIZADO E NÃO AO CONTRÁRIO

In [255]:
df.replace(1,99)

    A    B    C
0  99  NaN  NaN
1   2  4.0  7.0
2   3  5.0  NaN

In [257]:
df['B'].replace(4,6)

0    NaN
1    6.0
2    5.0
Name: B, dtype: float64

## juntar mais de um dataframe

## pd.contat() - aceita 2 ou mais dataframes - metodo no pandas
## merge() - aceita apenas 2 - metodo do pandas
## join() - metodo no dataframe

In [258]:
## ver o video e o notebook do prof pq era muita coisa pra escrever. preferi prestar atenção